In [1]:
import pandas as pd

In [11]:
df1 = pd.read_csv('insurance_data.csv')
df=pd.read_csv('survey.csv')

*To update column names*

In [6]:
#To rename all the columns
df1.columns = ['cge','bought']
df1.head()
#note: can only be used when passing all the column names

   cge  bought
0   22       0
1   25       0
2   47       1
3   52       0
4   46       1

In [9]:
#To change something specific about each column NAME...for eg: change to upper case,remove _ etc
#USE LIST COMPREHENSION
df1.columns = [x.upper() for x in df1.columns] #Since df1.columns also returns list, this iterates through the list
df1.head()
#Use x.lower() to get lower space

   CGE  BOUGHT
0   22       0
1   25       0
2   47       1
3   52       0
4   46       1

In cases where you want to remove spaces  (because df.bought insuarance won't work) or similar task
use str methods like replace

In [14]:
df1.columns = df1.columns.str.replace('_',' ') #This replaces spaces with underscores. vice verca can also be done
#df1.columns = df1.columns.str.replace('_',' ') does opposite

All previous methods were for all columns together. 
**FOR SPECIFIC COLUMNS** :-

In [20]:
df1.rename(columns={'CGE':'Age'},inplace=True)
df1.head(3)

   age  bought insurance
0   22                 0
1   27                 0
2   47                 1

**TO CHANGE ROWS, i.e DATA INSIDE COLUMNS**

In [19]:
#Use loc and iloc to grab values and then change

df1.loc[1] = [27,0]
df1.head(2)

   age  bought insurance
0   22                 0
1   27                 0

In [22]:
df1.loc[1,bought insurance] = 1
df1.head(2)

SyntaxError: invalid syntax (<ipython-input-22-c433cb71abc9>, line 2)

In [29]:
#df1.columns 
df1.columns = df1.columns.str.replace(' ','_')
df1.head()

   age  bought_insurance
0   22                 0
1   27                 0
2   47                 1
3   52                 0
4   46                 1

In [33]:
#To change single value,pass the exact location
df1.loc[1,'bought_insurance'] = 1
df1.head(2)
#df.at also does exact same job as df1.loc
#df1.at[1,'bought_insurance'] = 1

   age  bought_insurance
0   22                 0
1   27                 1

**TO UPDATE MULTIPLE ROWS OF DATA:** 
**apply,map,applymap,replace**

In [34]:
#For example,update all ages here: 
df1['age'] = 21
df1.head()

   age  bought_insurance
0   21                 0
1   21                 1
2   21                 1
3   21                 0
4   21                 1

APPLY METHOD

In [36]:
#apply method works with series and df. But is different in both cases
#for series
df1['age']=df1['age'].apply(lambda x: x+1) #returns copy, so should be saved
df1.head()

   age  bought_insurance
0   22                 0
1   22                 1
2   22                 1
3   22                 0
4   22                 1

In [37]:
df1.apply(len)

age                 27
bought_insurance    27
dtype: int64

In [46]:
df1.apply(len)

age                 27
bought_insurance    27
dtype: int64

In [50]:
#map method only works on series.
#used for substituting values. pass previous value, and new value.for eg. change name
df1['age'].map({22:21})

0     21
1     21
2     21
3     21
4     21
5     21
6     21
7     21
8     21
9     21
10    21
11    21
12    21
13    21
14    21
15    21
16    21
17    21
18    21
19    21
20    21
21    21
22    21
23    21
24    21
25    21
26    21
Name: age, dtype: int64